{
  "backend/main.mo": "Motoko actor storing validated contact form submissions in a map with auto-incremented IDs and a query to list all forms.",
  "feature_evidence.json": "Feature evidence report listing portfolio image enhancements, fallback handling, and configuration locations tied to specific frontend files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries describing each frontend file’s purpose across the React/Tailwind portfolio app.",
  "frontend/index.css": "Global Tailwind CSS setup defining design tokens, light/dark variables, and applying base background/foreground styles.",
  "frontend/index.html": "HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Main React app assembling all portfolio sections with refs for scroll navigation and smooth scrolling behavior.",
  "frontend/src/components/Footer.tsx": "Footer displaying logo, navigation links, contact info, and caffeine.ai attribution with dynamic year.",
  "frontend/src/components/GradientCTAButton.tsx": "Gradient-styled CTA button extending shadcn Button props with animated hover effects.",
  "frontend/src/components/PortfolioProjectImage.tsx": "Image component supporting external URLs with loading spinner, error fallback, and optional crossOrigin handling.",
  "frontend/src/components/sections/AboutSection.tsx": "Renders an about section with text, an image, and a CTA button that smooth-scrolls to the services section.",
  "frontend/src/components/sections/ClientResultsSection.tsx": "Displays a grid of client result images and a CTA that smooth-scrolls to the contact section.",
  "frontend/src/components/sections/ContactSection.tsx": "Implements a contact form with validation, submission via mutation, and contact info cards.",
  "frontend/src/components/sections/HeroSection.tsx": "Shows a hero banner with headline, description, background decorations, and a CTA that scrolls to contact.",
  "frontend/src/components/sections/PortfolioSection.tsx": "Displays a portfolio of solar marketing projects with images and performance metrics, plus a CTA to contact.",
  "frontend/src/components/sections/ServicesSection.tsx": "Lists service offerings with icons and descriptions and includes a CTA button that scrolls to the portfolio section.",
  "frontend/src/components/sections/TestimonialsSection.tsx": "Shows client testimonials in cards with avatars and a CTA that scrolls to the contact section.",
  "frontend/src/components/SectionShell.tsx": "Reusable wrapper providing section spacing, container layout, optional title, and gradient accent bar.",
  "frontend/src/components/SiteHeader.tsx": "Sticky header with active-section tracking, smooth scrolling, logo button, and responsive mobile menu.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor, invalidating related queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity authentication using AuthClient, including login state handling and identity persistence.",
  "frontend/src/hooks/useQueries.ts": "Defines a React Query mutation for submitting a contact form through an actor and invalidating related queries on success.",
  "frontend/src/index.css": "Configures Tailwind base styles, custom color variables, dark mode theming, and utility classes for the app.",
  "frontend/src/lib/utils.ts": "Exports a helper function that merges class names using clsx and tailwind-merge.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and Internet Identity providers.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending theme colors, fonts, animations, and enabling plugins like typography and container queries.",
  "project_state.json": "Tracks the project’s current state, requirements, architectural notes, issues, and planned features for the SolviroStudio portfolio site."
}