{
  "backend/main.mo": "Stores and validates contact form submissions, assigning incremental IDs and exposing submit and query functions.",
  "feature_evidence.json": "Feature evidence report mapping product requirements to affected frontend files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of each frontend file for documentation or planning.",
  "frontend/index.css": "Global Tailwind-based CSS defining color tokens, themes, and base styles for light and dark modes.",
  "frontend/index.html": "HTML entry point providing the root element and loading the main TypeScript bundle.",
  "frontend/src/App.tsx": "Top-level React component wiring all site sections, smooth scrolling, header, footer, and toasts.",
  "frontend/src/components/Footer.tsx": "Responsive footer with logo, quick links, contact details, and dynamic year plus attribution.",
  "frontend/src/components/GradientCTAButton.tsx": "Reusable gradient-styled CTA button extending the base Button component with brand colors.",
  "frontend/src/components/sections/AboutSection.tsx": "Renders an about section with text, an image, and a CTA button that scrolls to the services section.",
  "frontend/src/components/sections/ClientResultsSection.tsx": "Displays a grid of client result images and a CTA button that scrolls to the contact section.",
  "frontend/src/components/sections/ContactSection.tsx": "Provides a contact form with validation, submission via a mutation hook, and static contact info cards.",
  "frontend/src/components/sections/HeroSection.tsx": "Shows a hero banner with headline text, decorative graphics, and a CTA button that scrolls to the contact section.",
  "frontend/src/components/sections/PortfolioSection.tsx": "Renders a portfolio grid of project cards with metrics and a CTA button to view more, scrolling to the contact section.",
  "frontend/src/components/sections/ServicesSection.tsx": "Lists service cards with icons and descriptions plus a CTA button that scrolls to the portfolio section.",
  "frontend/src/components/sections/TestimonialsSection.tsx": "Displays testimonial cards with quotes, avatars, and a CTA button leading to the contact section.",
  "frontend/src/components/SectionShell.tsx": "Layout wrapper giving sections consistent spacing, titles, and gradient underline accents.",
  "frontend/src/components/SiteHeader.tsx": "Sticky responsive header with scroll‑spy highlighting, smooth anchor navigation, and mobile menu.",
  "frontend/src/hooks/useActor.ts": "Custom hook creating an authenticated or anonymous backend actor and invalidating dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and provider for Internet Identity authentication, handling identity loading, login, logout, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Defines a React Query mutation for submitting a contact form via an actor and invalidates related queries on success.",
  "frontend/src/index.css": "Sets global Tailwind CSS layers and defines light/dark theme CSS variables and utility classes.",
  "frontend/src/lib/utils.ts": "Exports a class name merging helper combining clsx and tailwind-merge.",
  "frontend/src/main.tsx": "Bootstraps the React app, setting up QueryClient and InternetIdentityProvider before rendering App.",
  "frontend/tailwind.config.js": "Configures Tailwind theme, colors, plugins, and container settings using custom CSS variable–based palettes.",
  "project_state.json": "Stores project metadata, requirements, features, images, and architectural notes for the SolviroStudio portfolio site."
}