{
  "kind": "build_request",
  "title": "Allow Pinterest-sourced images in the Portfolio section",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-23",
      "text": "Update the Portfolio section so portfolio project images can be sourced from Pinterest by using user-provided Pinterest image URLs (in addition to the existing local static asset image paths).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Could you please add images from Pinterest to the portfolio section of my site? I’d like them included to enhance the visual appeal."
        ]
      },
      "acceptanceCriteria": [
        "Portfolio project entries support an external image URL value (e.g., a direct Pinterest image URL) in addition to the existing local image path value.",
        "When a Pinterest image URL is provided for a project, the card renders that URL in the image element instead of the local asset path.",
        "Existing portfolio cards continue to render correctly when only local asset paths are provided (no regressions to layout, hover styling, metric badges, or visible title/goal/results text)."
      ]
    },
    {
      "id": "REQ-24",
      "text": "Add safe rendering behavior for externally hosted (Pinterest) portfolio images, including graceful fallback when an external image fails to load.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "add images from Pinterest to the portfolio section"
        ]
      },
      "acceptanceCriteria": [
        "If a Pinterest-hosted image fails to load, the UI does not break; the card shows a non-broken fallback (e.g., swaps to a configured fallback local image or renders a neutral placeholder area) while preserving the rest of the card content (title, goal, results text, badges).",
        "All portfolio images (local or Pinterest-hosted) include descriptive alt text that contains the project title (maintaining current accessibility behavior).",
        "External images are loaded in a performance-conscious way (e.g., lazy loading) without changing the grid layout or card sizing behavior."
      ]
    },
    {
      "id": "REQ-25",
      "text": "Provide a clear, editable place in the codebase to configure the Pinterest image URLs used by Portfolio project cards (without adding a Pinterest API integration).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "add images from Pinterest to the portfolio section"
        ]
      },
      "acceptanceCriteria": [
        "There is a single, obvious configuration location (e.g., within the existing portfolioProjects data in frontend/src/components/sections/PortfolioSection.tsx) where developers can paste Pinterest image URLs for each portfolio item.",
        "No automated scraping/crawling/downloading from Pinterest is implemented; the system only renders explicitly configured URLs.",
        "The app builds successfully with a mix of local asset image paths and Pinterest image URLs in the portfolioProjects data."
      ]
    }
  ],
  "constraints": [
    "Do not implement a Pinterest API integration, scraping, or automated downloading of Pinterest content; only use user-provided direct image URLs or already-uploaded/static assets.",
    "Do not edit any frontend immutable paths listed in SYSTEM_CONTEXT (compose existing components instead).",
    "Keep the existing Portfolio section behavior (grid layout, hover styling, metric badges rendering, and visible title/goal/results text) unchanged aside from adding Pinterest image support."
  ],
  "nonGoals": [
    "Adding a backend feature or storing Pinterest images in canister state.",
    "Building an image proxy service or external hosting pipeline.",
    "Changing the number of portfolio cards or rewriting portfolio copy unless required to wire in Pinterest images."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}