{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Allow Pinterest-sourced images in the Portfolio section",
  "requirements": [
    {
      "id": "REQ-23",
      "summary": "Allow each portfolio project card to use either a local static image path or a user-provided external (Pinterest) image URL.",
      "acceptanceCriteria": [
        "Portfolio project entries support an external image URL value (e.g., a direct Pinterest image URL) in addition to the existing local image path value.",
        "When a Pinterest image URL is provided for a project, the card renders that URL in the image element instead of the local asset path.",
        "Existing portfolio cards continue to render correctly when only local asset paths are provided (no regressions to layout, hover styling, metric badges, or visible title/goal/results text)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/sections/PortfolioSection.tsx",
          "operation": "modify",
          "description": "Update the portfolioProjects data and rendering so the image source can be either a local asset path or an external Pinterest image URL, while keeping the existing grid layout, hover styling, badges, and text unchanged."
        },
        {
          "path": "frontend/src/components/PortfolioProjectImage.tsx",
          "operation": "create",
          "description": "Create a small, reusable image wrapper used by PortfolioSection that can accept either a local path or external URL source while preserving the existing sizing/cover behavior. (Verify the component's usage instructions before implementing.)"
        },
        {
          "path": "frontend/src/components/sections/PortfolioSection.tsx",
          "operation": "modify",
          "description": "Wire the new PortfolioProjectImage component into the existing card image area (replacing the direct <img> usage) so Pinterest URLs can render without changing card structure. (Verify the component's usage instructions before implementing.)"
        }
      ]
    },
    {
      "id": "REQ-24",
      "summary": "Add safe, accessible, performance-conscious rendering for externally hosted portfolio images with graceful fallback on load errors.",
      "acceptanceCriteria": [
        "If a Pinterest-hosted image fails to load, the UI does not break; the card shows a non-broken fallback (e.g., swaps to a configured fallback local image or renders a neutral placeholder area) while preserving the rest of the card content (title, goal, results text, badges).",
        "All portfolio images (local or Pinterest-hosted) include descriptive alt text that contains the project title (maintaining current accessibility behavior).",
        "External images are loaded in a performance-conscious way (e.g., lazy loading) without changing the grid layout or card sizing behavior."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/PortfolioProjectImage.tsx",
          "operation": "create",
          "description": "Implement safe image loading behavior: lazy loading, decoding hints, alt text passthrough, and an onError fallback that swaps to a known local fallback image (e.g., an existing portfolio asset) or a neutral placeholder area, without affecting the fixed image container size. (Verify the component's usage instructions before implementing.)"
        },
        {
          "path": "frontend/src/components/sections/PortfolioSection.tsx",
          "operation": "modify",
          "description": "Ensure the alt text provided to the portfolio image always includes the project title, and pass the title-derived alt text into PortfolioProjectImage for both local and Pinterest-hosted images."
        }
      ]
    },
    {
      "id": "REQ-25",
      "summary": "Provide a single, obvious configuration location in code to paste Pinterest image URLs for portfolio items (no API integration).",
      "acceptanceCriteria": [
        "There is a single, obvious configuration location (e.g., within the existing portfolioProjects data in frontend/src/components/sections/PortfolioSection.tsx) where developers can paste Pinterest image URLs for each portfolio item.",
        "No automated scraping/crawling/downloading from Pinterest is implemented; the system only renders explicitly configured URLs.",
        "The app builds successfully with a mix of local asset image paths and Pinterest image URLs in the portfolioProjects data."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/sections/PortfolioSection.tsx",
          "operation": "modify",
          "description": "Refactor the portfolioProjects array to use a clearly named image field (or allow the existing field to accept either local paths or full external URLs) and add concise inline comments/examples showing where to paste direct Pinterest image URLs; keep all logic strictly declarative (no Pinterest API, scraping, or downloading)."
        },
        {
          "path": "frontend/src/components/sections/PortfolioSection.tsx",
          "operation": "modify",
          "description": "Add lightweight validation/normalization in the render layer (e.g., treat strings starting with http/https as external) to support mixed local and Pinterest URL values in the same portfolioProjects list, ensuring the app continues to build successfully."
        }
      ]
    }
  ]
}